ArtMoney Plugin
8.17
Deutsche Übersetzung:
Tim Krell
TimKrell@gmx.de
Ueber das Programm
Game Cheater
<d>. <ms> <yyyy>
Copyright (C) 1996-2021, System SoftLab
Falls Sie Fehler finden oder einen Wunsch haben,
schicken Sie mir ein E-Mail an folgende Adresse:
Die neueste Version ist immer auf der Programmhomepage
Wert
Suche
Filtern
Anzahl der Werte
Wählen Sie zuerst einen Prozess in der Liste aus.
Suchen Sie jetzt nach einem Wert.
Filtern Sie jetzt die Werte so lange aus, bis Sie den richtigen gefunden haben.
Es wurde nichts gefunden. Suchen Sie nochmal.
Deaktiviert
Gefunden:
Zahlen
Zahlen
Zahl
In der Tabelle:
Fehler beim Laden
Fehler beim Suchen
Fehler beim Filtern
Dieses Dateiformat wird nicht unterstützt.
Die Zahl kann nicht in den ausgewählten Typ umgewandelt werden.
kann nicht geladen werden.
Fortschritt der Suche
Fortschritt des Filterns
alle möglichen
Byte
Byte
Bytes
Falsche Methode. Probieren Sie eine andere.
Sek
Min
Sie haben keinen Typ ausgewählt.
Typgrösse kann nicht grösser sein als 
Geändert
Nicht geändert
Grösser geworden
Kleiner geworden
Die Tabelle wurde mit einer neueren Version erstellt.
Die Tabelle ist beschädigt.
Fehler beim Dateizugriff.
Ganzzahl 1 Byte
Ganzzahl 2 Bytes
Ganzzahl 3 Bytes
Ganzzahl 4 Bytes
Ganzzahl 8 Bytes
Fliesskomma 4 Bytes
Fliesskomma 6 Bytes
Fliesskomma 8 Bytes
Fliesskomma 10 Bytes
Text
Null-terminated string
Null string
Pascal string
Ganzzahl 2 Bytes(R)
Ganzzahl 3 Bytes(R)
Ganzzahl 4 Bytes(R)
Ganzzahl 8 Bytes(R)
Fliesskomma 4 Bytes(R)
Fliesskomma 6 Bytes(R)
Fliesskomma 8 Bytes(R)
Fliesskomma 10 Bytes(R)
Text(R)
R.Null String
R.Pascal string
Januar
Februar
Marz
April
Mai
Juni
Juli
August
September
Oktober
November
Dezember
E
Hilfe
Über...
Prozess:
&Neu
&Laden
&Speichern
Hinzufügen
Alle hinzufügen
Eigenschaften
Kopieren
Löschen
Einfrieren
Auftauen
Auto Adressänderung
&Information
Spieltyp
Einfrier Rate (ms)
Erneuern Rate (ms)
Sprache
Max. Tabellenzeilen
Tastenkombination
Allgemein
Erweitert
Autoren Info
E-Mail
Kommentar
Betriebssystem
Nachkommastellen
Bytefolge
Scanpriorität
Hoch
Voll
Einstellungen
Abbrechen
Normal
Eigenschaften der Adresse
Einfrieren
Grösse
Adresse
Beschreibung
Typ
Umkehren
Exakter Wert
Reihenfolge der Werte
Wertbereich (von...bis)
Unbekannter Wert
Codierter Wert
Benutzerdefiniert...
Wähle den Typ aus.
Bytefolge
Normale und Umgekehrte
Alle
Ganzzahlen
Fliesskomma
Verstrichene Zeit:
Verbleibende Zeit:
Geschwindigkeit:
Gefunden:
Programmname
Kommentar
Datum
System
Info über die Tabelle
Autor
Name
Ort
Geben Sie die Reihenfolge der Werte ein
Tastenkombination definieren
Umgekehrte
In diesem Speicherplatzblock suchen...
Im Adressbereich suchen
Festplattenspeicherplatz sparen
von
bis
Suche
Filtern
Schritt
Schritt//set value
Wert einstellen...
Alles auswählen
AUTO
Sichtbare Prozesse
sichtbare
mit Fenstern
Information über den Prozess...
Prozess schliessen
Zeigen
Verstecken
Sind Sie sicher, dass Sie diesen Prozess schliessen möchten?
Kein Zugang
Kann den Prozess nicht schliessen
Dateiname
Prozesstyp
Datengrösse
Benchmark
Scangeschwindigeits-Benchmark: Ergebnis
Warten
Ihr System
Tastenkombination
Zum Wert hinzufügen
Fenster fixieren
Rückg./Wiederh. des Filterns aktiviert
Ganzzahl ansicht
unsigned
signed
Filtern rückgängig machen
Filtern wiederholen
Gefiltertes speichern...
Gefiltertes laden...
Gegenwärtiger Schritt ist
"Filtern rückgängig machen" nicht aktiviert
"Filtern wiederholen" nicht aktiviert
"Gefiltertes laden..." nicht aktiviert
Grösser geworden um:
Kleiner geworden um:
Interface
Tastenkombination
Tastenkombination aktiviert
Standardtastenkombination
Hauptschrift
Tabellenschrift
Haupthintergrundfarbe
Tabellenhintergrundfarbe
Knopffarbe
Elliptische Knöpfe
OK
Speicher Editor
Hexadezimale ansicht
Hexadezimal editieren
Reihen
Zellen ansicht
Gegenwärtige Zelle
Bewegung
sich im Suchresultat bewegen
sich in der Tabelle bewegen
sich im Speicherbereich bewegen
sich zur Speicherstelle bewegen
|<-
<-
->
->|
Total
Aktuelles
Bereich kopieren
Bereich einfügen
Zur Tabelle hinzufügen
Alle (Standard)
Ganzzahl (Standard)
Fliesskomma (standard)
Markierung umkehren
Kolonnen anpassen
<Kein Wert>
Pointer
Aktualisieren
Bearbeiten...
Gruppe
Sichtbare Gruppe
Gruppe auswählen
Diese/n Adresse/Pointer speichern
Offset an allen anpassen
Offset an Gruppe anpassen
Offset an gespeicherte Adressen anpassen
Offset an gespeicherte Adressen in Gruppe anpassen
Pointer Befehle
Pointer auf alle einstellen
Pointer auf Gruppe einstellen
Gespeicherten Pointer auf alle einstellen
Gespeicherten Pointer auf Gruppe einstellen
Pointer auf diese Adresse einstellen
Pointer auf gespeicherte Adresse einstellen
Pointer zu dieser Adresse suchen
Pointer ab Anfang des Speicherblocks suchen
Sortieren
Sortieren nach Beschreibung
Sortieren nach Adresse
Sortieren nach Wert
Sortieren nach Wert (Als Text)
Sortieren nach Gruppe
&Hinzufügen
Hinzufügungs Fehler
Beide Tabellen müssen vom selben Autor sein.
Gegenwärtigen Prozess auswählen
Zeichensatz
Sichtbare Gruppen Umschalter
In der Gruppe
Pointer zu Adressen konvertieren
Filtern...
String
<Datei wurde nicht gefunden>
<Zugriff wurde verweigert>
Datei Editor
Fehlers
<Der Grösse wurde geändert>
Skin
Kein Skin
Schrift editieren
Tabellenfarbe
Abbild des Speichers speichern
Nach der Formel
Prozess
Den Prozess anhalten
Den Prozess fortsetzen
Den Prozess speichern
Den Prozess laden
Prozess ID
Die Anzahl der Strome
Datei(en)
Datei(en) Information
Die Datei wählen
Den Ordner wählen
Die Anzahl der Datei(en)
Insgesamte Grösse
In den Ordner verschieben
Das Objekt
&Datei
Be&enden
Ergebnis
Mehr
Kaufen sie online "ArtMoney Pro"!
Die Web-Seite zu besuchen
Die ArtMoney Bedienungsanleitung
Die Kodierung
Die Kodierung auswahlen
Die Helligkeit
Die Farbe
Das Hauptmenü anzeigen
Inoffizielle Sprachplugins verwenden
Den Prozess wahrend der Suche anhalten
Die Werte in die Tabelle speichern/laden
Die Bibliothek für die Durchsicht der Prozesse
Ordner optionen
Die Maske der Dateien
Die Zeit der Modifikation
Datei Datum
Datei Zeit
Nicht uberprufen
Die letzte 15 min
Die letzte Stunde
Den letzten Tag
Den letzten Monat
Das letzte Jahr
Mehr als
Früher als
Diese Funktion ist nur in ArtMoney Pro moglich
Nur in ArtMoney Pro
Das Lizenzabkommen
Ich bin mit allen Punkten dieses Vertrages einverstanden
Über die PRO Version
Der besondere Dank geht and
Für das Design der Bedienungsanleitung
Für das Warenzeichen
Für das Einstellungsmodul
Für das Programmsymbol
Für die grammatikalische Prufung der englischen Sprache
Für die Hilfe
Für die skin Engine (ThemeEngine Paket)
Für die Tipps und die wertvollen Bemerkungen
Für die Ubersetzungen
Für die Tabellen
Registrations Nummer
Nicht registriert
Nach dem Kennwort nicht mehr fragen
Nur für den aktuellen Windows Benutzer
Den Prozess anhalten und ArtMoney anzeigen
Zum Prozess wechseln un ihn fortsetzen
Die überflüssige Klammer schliessen
Die notwendige Klammer schliessen 
Die überflüssigen geschlossenen Anführungszeichen
Falsche ID
Die falsche Anzahl der Argumente (M1,M2...)
Die falsche Anzahl der Operationen (-,+)
Die falsche Anzahl der Bedingungen (<,>,=)
Die falsche Anzahl der Ausdruecke
Der falsche Ausdruck
Dieser Schritt existiert nicht
Die falsche Bedingung
Der falsche Parameter für
Es gibt keine Bedingungen
Suche
Registration
Kennwort
Fügen Sie bitte das Kennwort ein und drücken Sie auf "OK"
Falsches Kennwort
Falsche oder alte Schlüssel Datei
Keine Schlüssel Datei
Voreinstellung
Ist vom Benutzer aufgehoben
Die Bedienungsanleitung
Der Prozess wurde nicht gefunden
Die Werte in der Tabelle nur mit dem Prozess erneürn
Grösse des Codes
Karte des Prozesses
Adress Region
Zustand
Schutz der Region
Geschützt
Modulname
Die Vorliegende Funktion geht nur unter Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Das Speichern/Laden des Prozesses
Modus
Falscher Prozess. Der Prozess wurde geändert oder wurde neu gestartet.
Schliessen
In Excel
Der Wert mit einem Punkt abzurunden
Macromedia Flash
Umfang
Den Prozess in Gedanken zu halten
Ist des physischen Speichers zurückbehalten
Den neün Prozess starten
Installation
Verknüpfung auf den Desktop erstellen
Prozess verbergen
Den Prozess anzeigen
Emulator
Spiel system
Umfang der Adresse
Emulator Option benutzen
Die Karte des Speichers des Emulators
Emul. Adresse
PC Adresse
Wollen Sie die Emulator-Adressen zur PC-Adressen konvertieren?
Wollen Sie die PC-Addressen zu Emulator-Adressen konvertieren?
Fehler beim der konvertierung der Adressen
Automatische erkennung des Emulators über den Dateinamen
Die Gruppen
Baum der Gruppen anzeigen
Keinen
Links
Rechts
Neue Gruppe
Haupt
Sprache
Wollen Sie diese Sprache löschen?
Wollen Sie die neue Sprache einfugen?
Wollen Sie den Namen der Sprache Ändern?
Normal einfrieren
kann sich vergrössern
kann sich verkleinern
von Minimum bis Maximum
Minimum
Maximum
Gewähltes kopieren und einfügen
Download "Spyware Process Detector" Programm
"Spyware Process Detector" Programm wurde auf Ihrem Computer nicht gefunden. Sie können es runter laden und installieren von unserer Firmen Seite www.systemsoftlab.com. Das Programm kann mit ArtMoney zusammen arbeiten. Bei der Benutzung von "Spyware Process Detector", können Sie einen beliebigen Prozess öffnen, welcher den Zugriff sperrt. Das Programm zeigt ihnen ausführliche Informationen über die Prozesse, welche auf Ihrem PC laufen, und es entdeckt neue Spyware, Trojaner und Viren (welche unerkennbar für Ihrem Antivirus Scanner sind) .
Sie können uns Vorschläge oder Fehler zusenden.
Besuchen Sie unsere Firmen Seite// und laden Sie die anderen Programme herunter
Dies ist die kostenlose LIMITED Vers. Sie können die Vollversion für nur 21,90 € Kaufen. Es muss nur einmalig Bezahlt werden - alle Updates für diese Version sind Kostenlos!
Nur die registrierten Benutzer bekommen die volle technische Unterstützung und können alle zusätzlichen Funktionen verwenden.
Um die Vollversion zu kaufen, überzeugen Sie sich, dass Sie mit dem Internet verbunden sind, und clicken Sie auf jetzt Online registrieren.
jetzt Online registrieren
Service Installation
Windows soll die Authentizität des Benutzers bestätigen, um die Bedienung festzustellen.
Installieren als folgender Benutzer
Benutzername
Domäne
Service Installation fehler. Der Zugriff wurde verweigert.
Login fehlgeschlagen für Benutzer
Stealth mode
Mein Prozess verstecken
Mein Windows verstecken
Es ist eine alte Serviceversion installiert. Bitte starten sie neu um eine neue Version zu installieren.
Die Tabelle hat sich geändert
Wollen Sie die Änderungen speichern?
Nachfragen, ob änderungen beim Verlassen gespeichert werden sollen
Struktur
Übersprungen
Feld
Strukturgösse kann nicht mehr als
Punkt
Neuer Punkt
Such in der Struktur der Tabelle
Such in der Struktur der Gruppe
Such in der Struktur gewählten Adresse
Hoch
Runter
"ArtMoney Pro" kostenlos bekommen
zum grammaitschen Test der russischen Bedienungsanleitung
Rundungstyp
kaufmänisch
abrunden
aufrunden
runde auf null
Fortsetzen
Kostenlos bekommen
Disassembler
Assembleranweisung
Modul addressierung
Modul
Addresse in Modul
Konvertierungsfehler
Ich kann die Moduladrese nicht konvertieren: solch ein Modul ist nicht im Prozess.
Scanne Speicherbereich der System Module
Scanne Speicherbereich der gemeinsamen Module
Fehler beim öffnen des Prozesses
Prozess kann nicht geöffnet werden.
Versuch es mit der PRO Version.
Sie benötigen die PRO Version für diese Tabelle
ungültiges Register
ungültige Adresse
ungültiger Wert
der Wert ist zu hoch
ungültige Assembleranweisung
Starten Sie Artmoney als Administrator. Bitte klicken Sie mit der rechten Maustaste auf das Anwendungssymbol und wählen Sie den Eintrag "Als Administrator ausführen" im Kontextmenü aus.
Fehler beim Starten des Dienstes
Fehler beim Öffnen des Dienstes
Versuchen Sie den Computer neu zu starten
geändert von
Tabelle umsetzen
Wollen Sie die Tabelle in 64-bit umsetzen?
Wollen Sie die Tabelle in 32-bit umsetzen?
Umsetzungsfehler aufgetreten. Das Programm kann die Adresse nicht in 32-bit umsetzen.
Adresse multiplizieren//Addresse teilen
gleichmässig//durch 2 teilen
ungerade
Mehrfache von 4//Teilbar durch 4
Mehrfache von 8//Teilbar durch 8
Mehrfache von 16//Teilbar durch 16
Nur Statische Adressen in den Modulen scannen
zeig Moduloptionen
Registrationscode eingeben
Registrationscode aus der Zwischenablage einfügen (Ctrl-V oder "Einfügen" -Knopf) und "OK" drücken
einfügen
Der Registrationscode ist ungültig
Der Registrationscode ist nur für die englische Version
Der Registrationscode ist nur für die russische Version
Der Registrationscode ist nur für die alte Version
Der Registrationscode ist nicht mehr gültig. Bitte wenden Sie sich an sales@systemsoftlab.com für einen neuen Registrationscode
Wenn Sie hier nicht Ihren Namen und Daten hier sehen, benutzen Sie eine gecrackte oder gestohlene Version, und diese kann fehlerhaft funktionieren !
Pointer To Pointer
Maximum offset
Level von
Such den Pointer zum Pointer
Maximum 2 level für die SE edition!
Versuch die Driver Signature Enforcement zu deaktivieren
Schneller Modus (Benötigt mehr Speicher)
Mb
Automatisch das Offset verwenden und in eine neue Gruppe kopieren
Adresse im Block
Adresse kann nicht in einen Block konvertiert werden: Kein solcher Block im Prozess
Umrechnungsproblem: Blockgrösse ist nicht eindeutig.
Pointer nach Offset sortieren
Text verstecken für kompletten Tarnmodus//nur VIP
Online Spiele Accounts kaufen oder verkaufen
Neue Version zum Download verfügbar
Auf neue Version prüfen
Pointer mit offset
Pointer mit maximal möglichem Offset suchen
verfügbar von 2 schritten
Formel
Version
Immer im Vordergrund
"Immer im Vordergrund" aktivieren
"Immer im Vordergrund" deaktivieren
Kann systemsoftlab.com nicht öffnen. Bitte prüfen Sie ihre Internetverbindung
Versuche die Option zu setzen
Name/Module
Hex Code
Register
Flag
Debugger anhängen
Debugger abhängen
Den Debugger an den gewählten Prozess anhängen?
Breakpoints Liste
Kommandos
Debug
Debug Information speichern
Debug Information laden
Assembler Sprache
x86-32 Bit
x86-64 Bit
Breakpoint
Breakpoint hinzufügen
Breakpoint löschen
Start
Start bis
Bis zur Rückkehr
Trace Schritt
Trace Schritt über
Adressnamen setzen
Adressnamen löschen
Ja
Nein
Debugger Typ
Standard
Ausnahmebehandlung
Ausführbarer Breakpoint Typ
Software (int3 Instruktion)
int3
Debug Register (max 4)
register
Seiten Ausnahme
Ausnahmen
Zugriff auf den Breakpoint Typ
Fragen, wenn der Debugger an den Prozess angefügt wird
Software Breakpoint benutzen, wenn alle debug Register in Benutzung sind
Automatischen Speichern/Laden der Debug Infos
Benutze Debug Symbole
Symbolpfad
Activ
Stop
Ausführen
Jeder Zugriff
Schnreiben
Bedingungen
Änderungen
Alles aktivieren
Alles deaktivieren
Finde Anweisungen, die auf diese Adresse zugreifen
bei Speicherzugriff
bei Schreibzugriff
Bedingungsfehler
Änderungsfehler
Division durch 0
Lesefehler
Schreibfehler
Falsche linke Seite
Start
Stop
Zugriff
Ergebnisse löschen
Teilung durch threads
Nummer
Thread
8-bit
16-bit
32-bit
Hex
Hex
Float4
Float8
Hex Sequenz
systemsoflab.com antwortet nicht oder keine Internetverbindung
Registrierungscode ist gesperrt
Du kannst diesen Code nur 2 mal am Tag aktivieren
Der Registrierungscode ist nur für die VIP Edition
Debugger ausblenden
Tabelle in Unicode speichern
Größe bis zum Ende der Funktion erhalten (bis zur Rückgabe)
Lizenzen
Scan Speicher Regionen
Daten beschreibbar 
Daten nur lesen
Code beschreibbar
Code nur lesen
gemeinsam genutzt
System
geschützt
versteckt
Vielfältigkeit jeder Adresse
Addres Namen und Symbol Liste
Ordner symbole
Benutzer Namen
Groß- und Kleinschreibung
Ganze Wörter
Erste Position
Lesen/Schreiben
Automatische Erkennung der Grösse von Funktionen
Debug-Register ausblenden
Patchen Sie diese Funktionen (Strukturen)
Prozessschutz umgehen
Die eigenen Funktionen für den Zugriff auf Speicher
Funktionen im Benutzermodus (an den Prozess anhängen)
Funktionen im Kernel-Modus(über Treiber)
nhängen an den Prozess ohne Process öffnen
Signaturen
Signatur suche
Hinzufügen von Signatur
Offset
Automatische Suche
Statische Adresse
Regionen
Bearbeiten wie den Assemblercode
Als Assemblercode
In HEX umwandeln
Eindeutige Offsets pro Ebene begrenzen
Ersetzen des Codes
Ersetze den Code
Ersetzt alle Codes gleichzeitig
<ERSETZT>
<NICHT ERSETZT>
<KEIN MODUL>
<KEIN BLOCK>
<KEINE SIGNATUR>
<KEINE VARIABLE>
Code-Eifügen
Einfügen des Codes
Erst nach erfolgreichem Ersetzen des Codes
Automatisches Ersetzen aller Codes und einfügen
Alle Codes automatisch ersetzen und einfügen
Frage um Erlaubnis, alle Codes automatisch zu ersetzen und  ein zu fügen
Die Tabelle enthält einen Code zum einfügen und ersetzen. Es kann sich um bösartigen Code handeln! Laden Sie Tabellen nur von vertrauenswürdigen Websites herunter! Möchten Sie den Code in den Prozess einfügen?
Ersetze alle Codes füge sie ein
Ersetzen und einfügen von Code abbrechen
Signatur
Original Signatur
Falsche original Signatur
Addresse der Signature//komplett
Addresse der Sig.//kurz
Addresse der Variable/label//komplett
Addresse der Variable//kurz
Ich kann die Adresse der Signatur nicht konvertieren: Keine solche Signatur.
Ich kann die Adresse der Variablen nicht konvertieren: Keine solche Variable.
Name//Variable oder Bezeichnung
Codegröße zum Ersetzen 
Ein Assembler-Befehl
Mehrere Assembler-Anweisungen
Linie
Relativer Adressierungsfehler (Offset ist zu groß)
Ungültiger Multiplikator
Zurück jmp Fehler
Speicher kann nicht zugewiesen werden
Bereiche//Speicherbereiche
Spiegeladresse einstellen
Entferne Spiegeladresse
ab der Minimaladresse
Service
Zeiger-Offsets anzeigen in hexadecimal
Nutze RAX(EAX) register. Nur MOV-Anweisung mit RAX(EAX) Register kann eine absolute Adresse lesen/schreiben!
Prozessgeschwindigkeit Ändern
Deine Geschwindigkeit (%)
Normal//Geschwindigkeit
Prozessgeschwindigkeit ändern Fehler
Erhöhe Prozessgeschwindigkeit
Verlangsame Prozessgeschwindigkeit
Stapel/Stack
Ansicht als Stapel
Thread-Stapel speichern
Adresse ausgeben
Parameter
Parameters
Parameter in einer Zeile anzeigen
Adresse ausgeben nur im Modul
Fehler beim Lesen des Speichers
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D542BB56